benchmark/leveldb/results/large-ratio/mris_ratio_ssd.8.3.log
LevelDB:    version 1.5
Date:       Thu Dec  6 21:32:14 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    2081.371 micros/op;   10.0 MB/s small: 10000/0; big: 1250/0
Microseconds per op:
Count: 11250  Average: 2081.3875  StdDev: 14318.41
Min: 0.0000  Median: 1023.5294  Max: 740490.0000
------------------------------------------------------
[       0,       1 )     118   1.049%   1.049% 
[       1,       2 )     241   2.142%   3.191% 
[       2,       3 )     783   6.960%  10.151% #
[       3,       4 )      94   0.836%  10.987% 
[      10,      12 )       1   0.009%  10.996% 
[      14,      16 )       1   0.009%  11.004% 
[      18,      20 )       1   0.009%  11.013% 
[      20,      25 )      14   0.124%  11.138% 
[      25,      30 )      73   0.649%  11.787% 
[      30,      35 )     135   1.200%  12.987% 
[      35,      40 )     770   6.844%  19.831% #
[      40,      45 )     654   5.813%  25.644% #
[      45,      50 )      34   0.302%  25.947% 
[      50,      60 )      67   0.596%  26.542% 
[      60,      70 )       7   0.062%  26.604% 
[      70,      80 )       5   0.044%  26.649% 
[      80,      90 )     190   1.689%  28.338% 
[      90,     100 )     596   5.298%  33.636% #
[     100,     120 )     657   5.840%  39.476% #
[     120,     140 )     311   2.764%  42.240% #
[     140,     160 )     192   1.707%  43.947% 
[     160,     180 )     123   1.093%  45.040% 
[     180,     200 )      81   0.720%  45.760% 
[     200,     250 )      64   0.569%  46.329% 
[     250,     300 )      12   0.107%  46.436% 
[     300,     350 )       1   0.009%  46.444% 
[     400,     450 )      12   0.107%  46.551% 
[     450,     500 )       6   0.053%  46.604% 
[     500,     600 )      20   0.178%  46.782% 
[     600,     700 )      14   0.124%  46.907% 
[     700,     800 )      38   0.338%  47.244% 
[     800,     900 )      70   0.622%  47.867% 
[     900,    1000 )     172   1.529%  49.396% 
[    1000,    1200 )     578   5.138%  54.533% #
[    1200,    1400 )     406   3.609%  58.142% #
[    1400,    1600 )    1065   9.467%  67.609% ##
[    1600,    1800 )     186   1.653%  69.262% 
[    1800,    2000 )      37   0.329%  69.591% 
[    2000,    2500 )      89   0.791%  70.382% 
[    2500,    3000 )    1601  14.231%  84.613% ###
[    3000,    3500 )     402   3.573%  88.187% #
[    3500,    4000 )     240   2.133%  90.320% 
[    4000,    4500 )     284   2.524%  92.844% #
[    4500,    5000 )     143   1.271%  94.116% 
[    5000,    6000 )     292   2.596%  96.711% #
[    6000,    7000 )     217   1.929%  98.640% 
[    7000,    8000 )     108   0.960%  99.600% 
[    8000,    9000 )       7   0.062%  99.662% 
[    9000,   10000 )       1   0.009%  99.671% 
[   10000,   12000 )       1   0.009%  99.680% 
[   12000,   14000 )       1   0.009%  99.689% 
[   20000,   25000 )       1   0.009%  99.698% 
[   25000,   30000 )       2   0.018%  99.716% 
[   35000,   40000 )       1   0.009%  99.724% 
[   50000,   60000 )       1   0.009%  99.733% 
[   60000,   70000 )       1   0.009%  99.742% 
[   80000,   90000 )       3   0.027%  99.769% 
[  100000,  120000 )       3   0.027%  99.796% 
[  120000,  140000 )       6   0.053%  99.849% 
[  140000,  160000 )       1   0.009%  99.858% 
[  160000,  180000 )       1   0.009%  99.867% 
[  200000,  250000 )       6   0.053%  99.920% 
[  250000,  300000 )       3   0.027%  99.947% 
[  300000,  350000 )       3   0.027%  99.973% 
[  350000,  400000 )       1   0.009%  99.982% 
[  700000,  800000 )       2   0.018% 100.000% 

----- /mnt/largespace/mris_ratio_ssd_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	1250
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0